espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_ext_reg.h
/** GPIO_EXT_ETM_TASK_P3_CFG_REG register
 *  GPIO selection register 3 for ETM
 */
#define GPIO_EXT_ETM_TASK_P3_CFG_REG (DR_REG_GPIO_EXT_BASE + 0x164)
/** GPIO_EXT_ETM_TASK_GPIO15_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures to select an ETM task channel for GPIO15.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO15_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO15_SEL_M  (GPIO_EXT_ETM_TASK_GPIO15_SEL_V << GPIO_EXT_ETM_TASK_GPIO15_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO15_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO15_SEL_S  0
/** GPIO_EXT_ETM_TASK_GPIO15_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to enable GPIO15 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO15_EN    (BIT(5))
#define GPIO_EXT_ETM_TASK_GPIO15_EN_M  (GPIO_EXT_ETM_TASK_GPIO15_EN_V << GPIO_EXT_ETM_TASK_GPIO15_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO15_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO15_EN_S  5
/** GPIO_EXT_ETM_TASK_GPIO16_SEL : R/W; bitpos: [8:6]; default: 0;
 *  Configures to select an ETM task channel for GPIO16.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO16_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO16_SEL_M  (GPIO_EXT_ETM_TASK_GPIO16_SEL_V << GPIO_EXT_ETM_TASK_GPIO16_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO16_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO16_SEL_S  6
/** GPIO_EXT_ETM_TASK_GPIO16_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable GPIO16 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO16_EN    (BIT(11))
#define GPIO_EXT_ETM_TASK_GPIO16_EN_M  (GPIO_EXT_ETM_TASK_GPIO16_EN_V << GPIO_EXT_ETM_TASK_GPIO16_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO16_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO16_EN_S  11
/** GPIO_EXT_ETM_TASK_GPIO17_SEL : R/W; bitpos: [14:12]; default: 0;
 *  Configures to select an ETM task channel for GPIO17.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO17_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO17_SEL_M  (GPIO_EXT_ETM_TASK_GPIO17_SEL_V << GPIO_EXT_ETM_TASK_GPIO17_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO17_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO17_SEL_S  12
/** GPIO_EXT_ETM_TASK_GPIO17_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to enable GPIO17 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO17_EN    (BIT(17))
#define GPIO_EXT_ETM_TASK_GPIO17_EN_M  (GPIO_EXT_ETM_TASK_GPIO17_EN_V << GPIO_EXT_ETM_TASK_GPIO17_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO17_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO17_EN_S  17
/** GPIO_EXT_ETM_TASK_GPIO18_SEL : R/W; bitpos: [20:18]; default: 0;
 *  Configures to select an ETM task channel for GPIO18.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO18_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO18_SEL_M  (GPIO_EXT_ETM_TASK_GPIO18_SEL_V << GPIO_EXT_ETM_TASK_GPIO18_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO18_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO18_SEL_S  18
/** GPIO_EXT_ETM_TASK_GPIO18_EN : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to enable GPIO18 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO18_EN    (BIT(23))
#define GPIO_EXT_ETM_TASK_GPIO18_EN_M  (GPIO_EXT_ETM_TASK_GPIO18_EN_V << GPIO_EXT_ETM_TASK_GPIO18_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO18_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO18_EN_S  23
/** GPIO_EXT_ETM_TASK_GPIO19_SEL : R/W; bitpos: [26:24]; default: 0;
 *  Configures to select an ETM task channel for GPIO19.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO19_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO19_SEL_M  (GPIO_EXT_ETM_TASK_GPIO19_SEL_V << GPIO_EXT_ETM_TASK_GPIO19_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO19_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO19_SEL_S  24
/** GPIO_EXT_ETM_TASK_GPIO19_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether or not to enable GPIO19 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO19_EN    (BIT(29))
#define GPIO_EXT_ETM_TASK_GPIO19_EN_M  (GPIO_EXT_ETM_TASK_GPIO19_EN_V << GPIO_EXT_ETM_TASK_GPIO19_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO19_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO19_EN_S  29

/** GPIO_EXT_ETM_TASK_P4_CFG_REG register
 *  GPIO selection register 4 for ETM
 */
#define GPIO_EXT_ETM_TASK_P4_CFG_REG (DR_REG_GPIO_EXT_BASE + 0x168)
/** GPIO_EXT_ETM_TASK_GPIO20_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures to select an ETM task channel for GPIO20.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO20_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO20_SEL_M  (GPIO_EXT_ETM_TASK_GPIO20_SEL_V << GPIO_EXT_ETM_TASK_GPIO20_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO20_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO20_SEL_S  0
/** GPIO_EXT_ETM_TASK_GPIO20_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to enable GPIO20 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO20_EN    (BIT(5))
#define GPIO_EXT_ETM_TASK_GPIO20_EN_M  (GPIO_EXT_ETM_TASK_GPIO20_EN_V << GPIO_EXT_ETM_TASK_GPIO20_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO20_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO20_EN_S  5
/** GPIO_EXT_ETM_TASK_GPIO21_SEL : R/W; bitpos: [8:6]; default: 0;
 *  Configures to select an ETM task channel for GPIO21.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO21_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO21_SEL_M  (GPIO_EXT_ETM_TASK_GPIO21_SEL_V << GPIO_EXT_ETM_TASK_GPIO21_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO21_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO21_SEL_S  6
/** GPIO_EXT_ETM_TASK_GPIO21_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable GPIO21 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO21_EN    (BIT(11))
#define GPIO_EXT_ETM_TASK_GPIO21_EN_M  (GPIO_EXT_ETM_TASK_GPIO21_EN_V << GPIO_EXT_ETM_TASK_GPIO21_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO21_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO21_EN_S  11
/** GPIO_EXT_ETM_TASK_GPIO22_SEL : R/W; bitpos: [14:12]; default: 0;
 *  Configures to select an ETM task channel for GPIO22.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO22_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO22_SEL_M  (GPIO_EXT_ETM_TASK_GPIO22_SEL_V << GPIO_EXT_ETM_TASK_GPIO22_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO22_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO22_SEL_S  12
/** GPIO_EXT_ETM_TASK_GPIO22_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to enable GPIO22 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO22_EN    (BIT(17))
#define GPIO_EXT_ETM_TASK_GPIO22_EN_M  (GPIO_EXT_ETM_TASK_GPIO22_EN_V << GPIO_EXT_ETM_TASK_GPIO22_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO22_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO22_EN_S  17
/** GPIO_EXT_ETM_TASK_GPIO23_SEL : R/W; bitpos: [20:18]; default: 0;
 *  Configures to select an ETM task channel for GPIO23.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO23_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO23_SEL_M  (GPIO_EXT_ETM_TASK_GPIO23_SEL_V << GPIO_EXT_ETM_TASK_GPIO23_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO23_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO23_SEL_S  18
/** GPIO_EXT_ETM_TASK_GPIO23_EN : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to enable GPIO23 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO23_EN    (BIT(23))
#define GPIO_EXT_ETM_TASK_GPIO23_EN_M  (GPIO_EXT_ETM_TASK_GPIO23_EN_V << GPIO_EXT_ETM_TASK_GPIO23_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO23_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO23_EN_S  23
/** GPIO_EXT_ETM_TASK_GPIO24_SEL : R/W; bitpos: [26:24]; default: 0;
 *  Configures to select an ETM task channel for GPIO24.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO24_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO24_SEL_M  (GPIO_EXT_ETM_TASK_GPIO24_SEL_V << GPIO_EXT_ETM_TASK_GPIO24_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO24_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO24_SEL_S  24
/** GPIO_EXT_ETM_TASK_GPIO24_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether or not to enable GPIO24 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO24_EN    (BIT(29))
#define GPIO_EXT_ETM_TASK_GPIO24_EN_M  (GPIO_EXT_ETM_TASK_GPIO24_EN_V << GPIO_EXT_ETM_TASK_GPIO24_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO24_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO24_EN_S  29

/** GPIO_EXT_ETM_TASK_P5_CFG_REG register
 *  GPIO selection register 5 for ETM
 */
#define GPIO_EXT_ETM_TASK_P5_CFG_REG (DR_REG_GPIO_EXT_BASE + 0x16c)
/** GPIO_EXT_ETM_TASK_GPIO25_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures to select an ETM task channel for GPIO25.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO25_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO25_SEL_M  (GPIO_EXT_ETM_TASK_GPIO25_SEL_V << GPIO_EXT_ETM_TASK_GPIO25_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO25_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO25_SEL_S  0
/** GPIO_EXT_ETM_TASK_GPIO25_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to enable GPIO25 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO25_EN    (BIT(5))
#define GPIO_EXT_ETM_TASK_GPIO25_EN_M  (GPIO_EXT_ETM_TASK_GPIO25_EN_V << GPIO_EXT_ETM_TASK_GPIO25_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO25_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO25_EN_S  5
/** GPIO_EXT_ETM_TASK_GPIO26_SEL : R/W; bitpos: [8:6]; default: 0;
 *  Configures to select an ETM task channel for GPIO26.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO26_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO26_SEL_M  (GPIO_EXT_ETM_TASK_GPIO26_SEL_V << GPIO_EXT_ETM_TASK_GPIO26_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO26_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO26_SEL_S  6
/** GPIO_EXT_ETM_TASK_GPIO26_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable GPIO26 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO26_EN    (BIT(11))
#define GPIO_EXT_ETM_TASK_GPIO26_EN_M  (GPIO_EXT_ETM_TASK_GPIO26_EN_V << GPIO_EXT_ETM_TASK_GPIO26_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO26_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO26_EN_S  11
/** GPIO_EXT_ETM_TASK_GPIO27_SEL : R/W; bitpos: [14:12]; default: 0;
 *  Configures to select an ETM task channel for GPIO27.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO27_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO27_SEL_M  (GPIO_EXT_ETM_TASK_GPIO27_SEL_V << GPIO_EXT_ETM_TASK_GPIO27_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO27_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO27_SEL_S  12
/** GPIO_EXT_ETM_TASK_GPIO27_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to enable GPIO27 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO27_EN    (BIT(17))
#define GPIO_EXT_ETM_TASK_GPIO27_EN_M  (GPIO_EXT_ETM_TASK_GPIO27_EN_V << GPIO_EXT_ETM_TASK_GPIO27_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO27_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO27_EN_S  17
/** GPIO_EXT_ETM_TASK_GPIO28_SEL : R/W; bitpos: [20:18]; default: 0;
 *  Configures to select an ETM task channel for GPIO28.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO28_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO28_SEL_M  (GPIO_EXT_ETM_TASK_GPIO28_SEL_V << GPIO_EXT_ETM_TASK_GPIO28_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO28_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO28_SEL_S  18
/** GPIO_EXT_ETM_TASK_GPIO28_EN : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to enable GPIO28 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO28_EN    (BIT(23))
#define GPIO_EXT_ETM_TASK_GPIO28_EN_M  (GPIO_EXT_ETM_TASK_GPIO28_EN_V << GPIO_EXT_ETM_TASK_GPIO28_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO28_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO28_EN_S  23
/** GPIO_EXT_ETM_TASK_GPIO29_SEL : R/W; bitpos: [26:24]; default: 0;
 *  Configures to select an ETM task channel for GPIO29.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO29_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO29_SEL_M  (GPIO_EXT_ETM_TASK_GPIO29_SEL_V << GPIO_EXT_ETM_TASK_GPIO29_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO29_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO29_SEL_S  24
/** GPIO_EXT_ETM_TASK_GPIO29_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether or not to enable GPIO29 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO29_EN    (BIT(29))
#define GPIO_EXT_ETM_TASK_GPIO29_EN_M  (GPIO_EXT_ETM_TASK_GPIO29_EN_V << GPIO_EXT_ETM_TASK_GPIO29_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO29_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO29_EN_S  29

/** GPIO_EXT_ETM_TASK_P6_CFG_REG register
 *  GPIO selection register 6 for ETM
 */
#define GPIO_EXT_ETM_TASK_P6_CFG_REG (DR_REG_GPIO_EXT_BASE + 0x170)
/** GPIO_EXT_ETM_TASK_GPIO30_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures to select an ETM task channel for GPIO30.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO30_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO30_SEL_M  (GPIO_EXT_ETM_TASK_GPIO30_SEL_V << GPIO_EXT_ETM_TASK_GPIO30_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO30_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO30_SEL_S  0
/** GPIO_EXT_ETM_TASK_GPIO30_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to enable GPIO30 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO30_EN    (BIT(5))
#define GPIO_EXT_ETM_TASK_GPIO30_EN_M  (GPIO_EXT_ETM_TASK_GPIO30_EN_V << GPIO_EXT_ETM_TASK_GPIO30_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO30_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO30_EN_S  5
/** GPIO_EXT_ETM_TASK_GPIO31_SEL : R/W; bitpos: [8:6]; default: 0;
 *  Configures to select an ETM task channel for GPIO31.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO31_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO31_SEL_M  (GPIO_EXT_ETM_TASK_GPIO31_SEL_V << GPIO_EXT_ETM_TASK_GPIO31_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO31_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO31_SEL_S  6
/** GPIO_EXT_ETM_TASK_GPIO31_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable GPIO31 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO31_EN    (BIT(11))
#define GPIO_EXT_ETM_TASK_GPIO31_EN_M  (GPIO_EXT_ETM_TASK_GPIO31_EN_V << GPIO_EXT_ETM_TASK_GPIO31_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO31_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO31_EN_S  11
/** GPIO_EXT_ETM_TASK_GPIO32_SEL : R/W; bitpos: [14:12]; default: 0;
 *  Configures to select an ETM task channel for GPIO32.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO32_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO32_SEL_M  (GPIO_EXT_ETM_TASK_GPIO32_SEL_V << GPIO_EXT_ETM_TASK_GPIO32_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO32_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO32_SEL_S  12
/** GPIO_EXT_ETM_TASK_GPIO32_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to enable GPIO32 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO32_EN    (BIT(17))
#define GPIO_EXT_ETM_TASK_GPIO32_EN_M  (GPIO_EXT_ETM_TASK_GPIO32_EN_V << GPIO_EXT_ETM_TASK_GPIO32_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO32_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO32_EN_S  17
/** GPIO_EXT_ETM_TASK_GPIO33_SEL : R/W; bitpos: [20:18]; default: 0;
 *  Configures to select an ETM task channel for GPIO33.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO33_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO33_SEL_M  (GPIO_EXT_ETM_TASK_GPIO33_SEL_V << GPIO_EXT_ETM_TASK_GPIO33_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO33_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO33_SEL_S  18
/** GPIO_EXT_ETM_TASK_GPIO33_EN : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to enable GPIO33 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO33_EN    (BIT(23))
#define GPIO_EXT_ETM_TASK_GPIO33_EN_M  (GPIO_EXT_ETM_TASK_GPIO33_EN_V << GPIO_EXT_ETM_TASK_GPIO33_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO33_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO33_EN_S  23
/** GPIO_EXT_ETM_TASK_GPIO34_SEL : R/W; bitpos: [26:24]; default: 0;
 *  Configures to select an ETM task channel for GPIO34.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO34_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO34_SEL_M  (GPIO_EXT_ETM_TASK_GPIO34_SEL_V << GPIO_EXT_ETM_TASK_GPIO34_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO34_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO34_SEL_S  24
/** GPIO_EXT_ETM_TASK_GPIO34_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether or not to enable GPIO34 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO34_EN    (BIT(29))
#define GPIO_EXT_ETM_TASK_GPIO34_EN_M  (GPIO_EXT_ETM_TASK_GPIO34_EN_V << GPIO_EXT_ETM_TASK_GPIO34_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO34_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO34_EN_S  29

/** GPIO_EXT_ETM_TASK_P7_CFG_REG register
 *  GPIO selection register 7 for ETM
 */
#define GPIO_EXT_ETM_TASK_P7_CFG_REG (DR_REG_GPIO_EXT_BASE + 0x174)
/** GPIO_EXT_ETM_TASK_GPIO35_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures to select an ETM task channel for GPIO35.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO35_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO35_SEL_M  (GPIO_EXT_ETM_TASK_GPIO35_SEL_V << GPIO_EXT_ETM_TASK_GPIO35_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO35_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO35_SEL_S  0
/** GPIO_EXT_ETM_TASK_GPIO35_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to enable GPIO35 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO35_EN    (BIT(5))
#define GPIO_EXT_ETM_TASK_GPIO35_EN_M  (GPIO_EXT_ETM_TASK_GPIO35_EN_V << GPIO_EXT_ETM_TASK_GPIO35_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO35_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO35_EN_S  5
/** GPIO_EXT_ETM_TASK_GPIO36_SEL : R/W; bitpos: [8:6]; default: 0;
 *  Configures to select an ETM task channel for GPIO36.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO36_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO36_SEL_M  (GPIO_EXT_ETM_TASK_GPIO36_SEL_V << GPIO_EXT_ETM_TASK_GPIO36_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO36_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO36_SEL_S  6
/** GPIO_EXT_ETM_TASK_GPIO36_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable GPIO36 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO36_EN    (BIT(11))
#define GPIO_EXT_ETM_TASK_GPIO36_EN_M  (GPIO_EXT_ETM_TASK_GPIO36_EN_V << GPIO_EXT_ETM_TASK_GPIO36_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO36_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO36_EN_S  11
/** GPIO_EXT_ETM_TASK_GPIO37_SEL : R/W; bitpos: [14:12]; default: 0;
 *  Configures to select an ETM task channel for GPIO37.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO37_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO37_SEL_M  (GPIO_EXT_ETM_TASK_GPIO37_SEL_V << GPIO_EXT_ETM_TASK_GPIO37_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO37_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO37_SEL_S  12
/** GPIO_EXT_ETM_TASK_GPIO37_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to enable GPIO37 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO37_EN    (BIT(17))
#define GPIO_EXT_ETM_TASK_GPIO37_EN_M  (GPIO_EXT_ETM_TASK_GPIO37_EN_V << GPIO_EXT_ETM_TASK_GPIO37_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO37_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO37_EN_S  17
/** GPIO_EXT_ETM_TASK_GPIO38_SEL : R/W; bitpos: [20:18]; default: 0;
 *  Configures to select an ETM task channel for GPIO38.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO38_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO38_SEL_M  (GPIO_EXT_ETM_TASK_GPIO38_SEL_V << GPIO_EXT_ETM_TASK_GPIO38_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO38_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO38_SEL_S  18
/** GPIO_EXT_ETM_TASK_GPIO38_EN : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to enable GPIO38 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO38_EN    (BIT(23))
#define GPIO_EXT_ETM_TASK_GPIO38_EN_M  (GPIO_EXT_ETM_TASK_GPIO38_EN_V << GPIO_EXT_ETM_TASK_GPIO38_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO38_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO38_EN_S  23
/** GPIO_EXT_ETM_TASK_GPIO39_SEL : R/W; bitpos: [26:24]; default: 0;
 *  Configures to select an ETM task channel for GPIO39.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO39_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO39_SEL_M  (GPIO_EXT_ETM_TASK_GPIO39_SEL_V << GPIO_EXT_ETM_TASK_GPIO39_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO39_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO39_SEL_S  24
/** GPIO_EXT_ETM_TASK_GPIO39_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether or not to enable GPIO39 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO39_EN    (BIT(29))
#define GPIO_EXT_ETM_TASK_GPIO39_EN_M  (GPIO_EXT_ETM_TASK_GPIO39_EN_V << GPIO_EXT_ETM_TASK_GPIO39_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO39_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO39_EN_S  29

