espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_ext_reg.h
/** GPIO_EXT_ETM_TASK_P8_CFG_REG register
 *  GPIO selection register 8 for ETM
 */
#define GPIO_EXT_ETM_TASK_P8_CFG_REG (DR_REG_GPIO_EXT_BASE + 0x178)
/** GPIO_EXT_ETM_TASK_GPIO40_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures to select an ETM task channel for GPIO40.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO40_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO40_SEL_M  (GPIO_EXT_ETM_TASK_GPIO40_SEL_V << GPIO_EXT_ETM_TASK_GPIO40_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO40_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO40_SEL_S  0
/** GPIO_EXT_ETM_TASK_GPIO40_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to enable GPIO40 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO40_EN    (BIT(5))
#define GPIO_EXT_ETM_TASK_GPIO40_EN_M  (GPIO_EXT_ETM_TASK_GPIO40_EN_V << GPIO_EXT_ETM_TASK_GPIO40_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO40_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO40_EN_S  5
/** GPIO_EXT_ETM_TASK_GPIO41_SEL : R/W; bitpos: [8:6]; default: 0;
 *  Configures to select an ETM task channel for GPIO41.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO41_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO41_SEL_M  (GPIO_EXT_ETM_TASK_GPIO41_SEL_V << GPIO_EXT_ETM_TASK_GPIO41_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO41_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO41_SEL_S  6
/** GPIO_EXT_ETM_TASK_GPIO41_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable GPIO41 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO41_EN    (BIT(11))
#define GPIO_EXT_ETM_TASK_GPIO41_EN_M  (GPIO_EXT_ETM_TASK_GPIO41_EN_V << GPIO_EXT_ETM_TASK_GPIO41_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO41_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO41_EN_S  11
/** GPIO_EXT_ETM_TASK_GPIO42_SEL : R/W; bitpos: [14:12]; default: 0;
 *  Configures to select an ETM task channel for GPIO42.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO42_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO42_SEL_M  (GPIO_EXT_ETM_TASK_GPIO42_SEL_V << GPIO_EXT_ETM_TASK_GPIO42_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO42_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO42_SEL_S  12
/** GPIO_EXT_ETM_TASK_GPIO42_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to enable GPIO42 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO42_EN    (BIT(17))
#define GPIO_EXT_ETM_TASK_GPIO42_EN_M  (GPIO_EXT_ETM_TASK_GPIO42_EN_V << GPIO_EXT_ETM_TASK_GPIO42_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO42_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO42_EN_S  17
/** GPIO_EXT_ETM_TASK_GPIO43_SEL : R/W; bitpos: [20:18]; default: 0;
 *  Configures to select an ETM task channel for GPIO43.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO43_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO43_SEL_M  (GPIO_EXT_ETM_TASK_GPIO43_SEL_V << GPIO_EXT_ETM_TASK_GPIO43_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO43_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO43_SEL_S  18
/** GPIO_EXT_ETM_TASK_GPIO43_EN : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to enable GPIO43 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO43_EN    (BIT(23))
#define GPIO_EXT_ETM_TASK_GPIO43_EN_M  (GPIO_EXT_ETM_TASK_GPIO43_EN_V << GPIO_EXT_ETM_TASK_GPIO43_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO43_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO43_EN_S  23
/** GPIO_EXT_ETM_TASK_GPIO44_SEL : R/W; bitpos: [26:24]; default: 0;
 *  Configures to select an ETM task channel for GPIO44.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO44_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO44_SEL_M  (GPIO_EXT_ETM_TASK_GPIO44_SEL_V << GPIO_EXT_ETM_TASK_GPIO44_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO44_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO44_SEL_S  24
/** GPIO_EXT_ETM_TASK_GPIO44_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether or not to enable GPIO44 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO44_EN    (BIT(29))
#define GPIO_EXT_ETM_TASK_GPIO44_EN_M  (GPIO_EXT_ETM_TASK_GPIO44_EN_V << GPIO_EXT_ETM_TASK_GPIO44_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO44_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO44_EN_S  29

/** GPIO_EXT_ETM_TASK_P9_CFG_REG register
 *  GPIO selection register 9 for ETM
 */
#define GPIO_EXT_ETM_TASK_P9_CFG_REG (DR_REG_GPIO_EXT_BASE + 0x17c)
/** GPIO_EXT_ETM_TASK_GPIO45_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures to select an ETM task channel for GPIO45.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO45_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO45_SEL_M  (GPIO_EXT_ETM_TASK_GPIO45_SEL_V << GPIO_EXT_ETM_TASK_GPIO45_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO45_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO45_SEL_S  0
/** GPIO_EXT_ETM_TASK_GPIO45_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to enable GPIO45 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO45_EN    (BIT(5))
#define GPIO_EXT_ETM_TASK_GPIO45_EN_M  (GPIO_EXT_ETM_TASK_GPIO45_EN_V << GPIO_EXT_ETM_TASK_GPIO45_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO45_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO45_EN_S  5
/** GPIO_EXT_ETM_TASK_GPIO46_SEL : R/W; bitpos: [8:6]; default: 0;
 *  Configures to select an ETM task channel for GPIO46.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO46_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO46_SEL_M  (GPIO_EXT_ETM_TASK_GPIO46_SEL_V << GPIO_EXT_ETM_TASK_GPIO46_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO46_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO46_SEL_S  6
/** GPIO_EXT_ETM_TASK_GPIO46_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable GPIO46 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO46_EN    (BIT(11))
#define GPIO_EXT_ETM_TASK_GPIO46_EN_M  (GPIO_EXT_ETM_TASK_GPIO46_EN_V << GPIO_EXT_ETM_TASK_GPIO46_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO46_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO46_EN_S  11
/** GPIO_EXT_ETM_TASK_GPIO47_SEL : R/W; bitpos: [14:12]; default: 0;
 *  Configures to select an ETM task channel for GPIO47.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO47_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO47_SEL_M  (GPIO_EXT_ETM_TASK_GPIO47_SEL_V << GPIO_EXT_ETM_TASK_GPIO47_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO47_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO47_SEL_S  12
/** GPIO_EXT_ETM_TASK_GPIO47_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to enable GPIO47 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO47_EN    (BIT(17))
#define GPIO_EXT_ETM_TASK_GPIO47_EN_M  (GPIO_EXT_ETM_TASK_GPIO47_EN_V << GPIO_EXT_ETM_TASK_GPIO47_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO47_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO47_EN_S  17
/** GPIO_EXT_ETM_TASK_GPIO48_SEL : R/W; bitpos: [20:18]; default: 0;
 *  Configures to select an ETM task channel for GPIO48.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO48_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO48_SEL_M  (GPIO_EXT_ETM_TASK_GPIO48_SEL_V << GPIO_EXT_ETM_TASK_GPIO48_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO48_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO48_SEL_S  18
/** GPIO_EXT_ETM_TASK_GPIO48_EN : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to enable GPIO48 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO48_EN    (BIT(23))
#define GPIO_EXT_ETM_TASK_GPIO48_EN_M  (GPIO_EXT_ETM_TASK_GPIO48_EN_V << GPIO_EXT_ETM_TASK_GPIO48_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO48_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO48_EN_S  23
/** GPIO_EXT_ETM_TASK_GPIO49_SEL : R/W; bitpos: [26:24]; default: 0;
 *  Configures to select an ETM task channel for GPIO49.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO49_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO49_SEL_M  (GPIO_EXT_ETM_TASK_GPIO49_SEL_V << GPIO_EXT_ETM_TASK_GPIO49_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO49_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO49_SEL_S  24
/** GPIO_EXT_ETM_TASK_GPIO49_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether or not to enable GPIO49 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO49_EN    (BIT(29))
#define GPIO_EXT_ETM_TASK_GPIO49_EN_M  (GPIO_EXT_ETM_TASK_GPIO49_EN_V << GPIO_EXT_ETM_TASK_GPIO49_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO49_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO49_EN_S  29

/** GPIO_EXT_ETM_TASK_P10_CFG_REG register
 *  GPIO selection register 10 for ETM
 */
#define GPIO_EXT_ETM_TASK_P10_CFG_REG (DR_REG_GPIO_EXT_BASE + 0x180)
/** GPIO_EXT_ETM_TASK_GPIO50_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures to select an ETM task channel for GPIO50.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO50_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO50_SEL_M  (GPIO_EXT_ETM_TASK_GPIO50_SEL_V << GPIO_EXT_ETM_TASK_GPIO50_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO50_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO50_SEL_S  0
/** GPIO_EXT_ETM_TASK_GPIO50_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to enable GPIO50 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO50_EN    (BIT(5))
#define GPIO_EXT_ETM_TASK_GPIO50_EN_M  (GPIO_EXT_ETM_TASK_GPIO50_EN_V << GPIO_EXT_ETM_TASK_GPIO50_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO50_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO50_EN_S  5
/** GPIO_EXT_ETM_TASK_GPIO51_SEL : R/W; bitpos: [8:6]; default: 0;
 *  Configures to select an ETM task channel for GPIO51.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO51_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO51_SEL_M  (GPIO_EXT_ETM_TASK_GPIO51_SEL_V << GPIO_EXT_ETM_TASK_GPIO51_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO51_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO51_SEL_S  6
/** GPIO_EXT_ETM_TASK_GPIO51_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable GPIO51 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO51_EN    (BIT(11))
#define GPIO_EXT_ETM_TASK_GPIO51_EN_M  (GPIO_EXT_ETM_TASK_GPIO51_EN_V << GPIO_EXT_ETM_TASK_GPIO51_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO51_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO51_EN_S  11
/** GPIO_EXT_ETM_TASK_GPIO52_SEL : R/W; bitpos: [14:12]; default: 0;
 *  Configures to select an ETM task channel for GPIO52.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO52_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO52_SEL_M  (GPIO_EXT_ETM_TASK_GPIO52_SEL_V << GPIO_EXT_ETM_TASK_GPIO52_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO52_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO52_SEL_S  12
/** GPIO_EXT_ETM_TASK_GPIO52_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to enable GPIO52 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO52_EN    (BIT(17))
#define GPIO_EXT_ETM_TASK_GPIO52_EN_M  (GPIO_EXT_ETM_TASK_GPIO52_EN_V << GPIO_EXT_ETM_TASK_GPIO52_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO52_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO52_EN_S  17
/** GPIO_EXT_ETM_TASK_GPIO53_SEL : R/W; bitpos: [20:18]; default: 0;
 *  Configures to select an ETM task channel for GPIO53.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO53_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO53_SEL_M  (GPIO_EXT_ETM_TASK_GPIO53_SEL_V << GPIO_EXT_ETM_TASK_GPIO53_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO53_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO53_SEL_S  18
/** GPIO_EXT_ETM_TASK_GPIO53_EN : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to enable GPIO53 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO53_EN    (BIT(23))
#define GPIO_EXT_ETM_TASK_GPIO53_EN_M  (GPIO_EXT_ETM_TASK_GPIO53_EN_V << GPIO_EXT_ETM_TASK_GPIO53_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO53_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO53_EN_S  23
/** GPIO_EXT_ETM_TASK_GPIO54_SEL : R/W; bitpos: [26:24]; default: 0;
 *  Configures to select an ETM task channel for GPIO54.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO54_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO54_SEL_M  (GPIO_EXT_ETM_TASK_GPIO54_SEL_V << GPIO_EXT_ETM_TASK_GPIO54_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO54_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO54_SEL_S  24
/** GPIO_EXT_ETM_TASK_GPIO54_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether or not to enable GPIO54 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO54_EN    (BIT(29))
#define GPIO_EXT_ETM_TASK_GPIO54_EN_M  (GPIO_EXT_ETM_TASK_GPIO54_EN_V << GPIO_EXT_ETM_TASK_GPIO54_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO54_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO54_EN_S  29

/** GPIO_EXT_ETM_TASK_P11_CFG_REG register
 *  GPIO selection register 11 for ETM
 */
#define GPIO_EXT_ETM_TASK_P11_CFG_REG (DR_REG_GPIO_EXT_BASE + 0x184)
/** GPIO_EXT_ETM_TASK_GPIO55_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures to select an ETM task channel for GPIO55.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO55_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO55_SEL_M  (GPIO_EXT_ETM_TASK_GPIO55_SEL_V << GPIO_EXT_ETM_TASK_GPIO55_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO55_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO55_SEL_S  0
/** GPIO_EXT_ETM_TASK_GPIO55_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to enable GPIO55 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO55_EN    (BIT(5))
#define GPIO_EXT_ETM_TASK_GPIO55_EN_M  (GPIO_EXT_ETM_TASK_GPIO55_EN_V << GPIO_EXT_ETM_TASK_GPIO55_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO55_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO55_EN_S  5
/** GPIO_EXT_ETM_TASK_GPIO56_SEL : R/W; bitpos: [8:6]; default: 0;
 *  Configures to select an ETM task channel for GPIO56.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO56_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO56_SEL_M  (GPIO_EXT_ETM_TASK_GPIO56_SEL_V << GPIO_EXT_ETM_TASK_GPIO56_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO56_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO56_SEL_S  6
/** GPIO_EXT_ETM_TASK_GPIO56_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable GPIO56 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO56_EN    (BIT(11))
#define GPIO_EXT_ETM_TASK_GPIO56_EN_M  (GPIO_EXT_ETM_TASK_GPIO56_EN_V << GPIO_EXT_ETM_TASK_GPIO56_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO56_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO56_EN_S  11
/** GPIO_EXT_ETM_TASK_GPIO57_SEL : R/W; bitpos: [14:12]; default: 0;
 *  Configures to select an ETM task channel for GPIO57.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO57_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO57_SEL_M  (GPIO_EXT_ETM_TASK_GPIO57_SEL_V << GPIO_EXT_ETM_TASK_GPIO57_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO57_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO57_SEL_S  12
/** GPIO_EXT_ETM_TASK_GPIO57_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to enable GPIO57 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO57_EN    (BIT(17))
#define GPIO_EXT_ETM_TASK_GPIO57_EN_M  (GPIO_EXT_ETM_TASK_GPIO57_EN_V << GPIO_EXT_ETM_TASK_GPIO57_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO57_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO57_EN_S  17
/** GPIO_EXT_ETM_TASK_GPIO58_SEL : R/W; bitpos: [20:18]; default: 0;
 *  Configures to select an ETM task channel for GPIO58.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO58_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO58_SEL_M  (GPIO_EXT_ETM_TASK_GPIO58_SEL_V << GPIO_EXT_ETM_TASK_GPIO58_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO58_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO58_SEL_S  18
/** GPIO_EXT_ETM_TASK_GPIO58_EN : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to enable GPIO58 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO58_EN    (BIT(23))
#define GPIO_EXT_ETM_TASK_GPIO58_EN_M  (GPIO_EXT_ETM_TASK_GPIO58_EN_V << GPIO_EXT_ETM_TASK_GPIO58_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO58_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO58_EN_S  23
/** GPIO_EXT_ETM_TASK_GPIO59_SEL : R/W; bitpos: [26:24]; default: 0;
 *  Configures to select an ETM task channel for GPIO59.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO59_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO59_SEL_M  (GPIO_EXT_ETM_TASK_GPIO59_SEL_V << GPIO_EXT_ETM_TASK_GPIO59_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO59_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO59_SEL_S  24
/** GPIO_EXT_ETM_TASK_GPIO59_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether or not to enable GPIO59 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO59_EN    (BIT(29))
#define GPIO_EXT_ETM_TASK_GPIO59_EN_M  (GPIO_EXT_ETM_TASK_GPIO59_EN_V << GPIO_EXT_ETM_TASK_GPIO59_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO59_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO59_EN_S  29

/** GPIO_EXT_ETM_TASK_P12_CFG_REG register
 *  GPIO selection register 12 for ETM
 */
#define GPIO_EXT_ETM_TASK_P12_CFG_REG (DR_REG_GPIO_EXT_BASE + 0x188)
/** GPIO_EXT_ETM_TASK_GPIO60_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures to select an ETM task channel for GPIO60.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO60_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO60_SEL_M  (GPIO_EXT_ETM_TASK_GPIO60_SEL_V << GPIO_EXT_ETM_TASK_GPIO60_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO60_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO60_SEL_S  0
/** GPIO_EXT_ETM_TASK_GPIO60_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to enable GPIO60 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO60_EN    (BIT(5))
#define GPIO_EXT_ETM_TASK_GPIO60_EN_M  (GPIO_EXT_ETM_TASK_GPIO60_EN_V << GPIO_EXT_ETM_TASK_GPIO60_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO60_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO60_EN_S  5
/** GPIO_EXT_ETM_TASK_GPIO61_SEL : R/W; bitpos: [8:6]; default: 0;
 *  Configures to select an ETM task channel for GPIO61.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO61_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO61_SEL_M  (GPIO_EXT_ETM_TASK_GPIO61_SEL_V << GPIO_EXT_ETM_TASK_GPIO61_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO61_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO61_SEL_S  6
/** GPIO_EXT_ETM_TASK_GPIO61_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable GPIO61 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO61_EN    (BIT(11))
#define GPIO_EXT_ETM_TASK_GPIO61_EN_M  (GPIO_EXT_ETM_TASK_GPIO61_EN_V << GPIO_EXT_ETM_TASK_GPIO61_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO61_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO61_EN_S  11
/** GPIO_EXT_ETM_TASK_GPIO62_SEL : R/W; bitpos: [14:12]; default: 0;
 *  Configures to select an ETM task channel for GPIO62.
 *  0: Select channel 0
 *  1: Select channel 1
 *  ......
 *  7: Select channel 7
 */
#define GPIO_EXT_ETM_TASK_GPIO62_SEL    0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO62_SEL_M  (GPIO_EXT_ETM_TASK_GPIO62_SEL_V << GPIO_EXT_ETM_TASK_GPIO62_SEL_S)
#define GPIO_EXT_ETM_TASK_GPIO62_SEL_V  0x00000007U
#define GPIO_EXT_ETM_TASK_GPIO62_SEL_S  12
/** GPIO_EXT_ETM_TASK_GPIO62_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to enable GPIO62 to response ETM task.
 *  0: Not enable
 *  1: Enable
 */
#define GPIO_EXT_ETM_TASK_GPIO62_EN    (BIT(17))
#define GPIO_EXT_ETM_TASK_GPIO62_EN_M  (GPIO_EXT_ETM_TASK_GPIO62_EN_V << GPIO_EXT_ETM_TASK_GPIO62_EN_S)
#define GPIO_EXT_ETM_TASK_GPIO62_EN_V  0x00000001U
#define GPIO_EXT_ETM_TASK_GPIO62_EN_S  17

/** GPIO_EXT_VERSION_REG register
 *  Version control register
 */
#define GPIO_EXT_VERSION_REG (DR_REG_GPIO_EXT_BASE + 0x1fc)
/** GPIO_EXT_DATE : R/W; bitpos: [27:0]; default: 38830416;
 *  Version control register.
 */
#define GPIO_EXT_DATE    0x0FFFFFFFU
#define GPIO_EXT_DATE_M  (GPIO_EXT_DATE_V << GPIO_EXT_DATE_S)
#define GPIO_EXT_DATE_V  0x0FFFFFFFU
#define GPIO_EXT_DATE_S  0

#ifdef __cplusplus
}
#endif
